<template>
  <div class="loan-terms">
    <div class="section_in">
      <h1 class="title">Пользовательское Соглашение</h1>
      <div class="content">
        <div class="block-term">
          <p>
            Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует
            отношения между (далее Автосалон https://autocarmsk.ru/ или
            Администрация) с одной стороны и пользователем сайта с другой.
          </p>
          <p>
            Сайт https://autocarmsk.ru/ не является средством массовой
            информации. Используя сайт, Вы соглашаетесь с условиями данного
            соглашения. Если Вы не согласны с условиями данного соглашения, не
            используйте сайт https://autocarmsk.ru/!
          </p>
          <h2>Предмет соглашения</h2>
          <p>
            Администрация предоставляет пользователю право на размещение на
            сайте следующей информации:
          </p>
          <p>
            Текстовой информации Ссылок на материалы, размещенные на других
            сайтах
          </p>
          <p>Права и обязанности сторон Пользователь имеет право:</p>
          <ul>
            <li>Осуществлять поиск информации на сайте</li>
            <li>Получать информацию на сайте</li>
            <li>
              Копировать информацию на другие сайты с разрешения Администрации
              сайта — требовать от администрации скрытия любой информации
              переданной пользователем сайту
            </li>
            <li>Использовать информацию сайта в личных некоммерческих целях</li>
          </ul>
          <h2>Администрация имеет право:</h2>
          <ul>
            <li>
              По своему усмотрению и необходимости создавать, изменять, отменять
              правила
            </li>
            <li>Ограничивать доступ к любой информации на сайте</li>
            <li>
              Создавать, изменять, удалять информацию Удалять учетные записи
            </li>
            <li>Отказывать в регистрации без объяснения причин</li>
          </ul>
          <h2>Пользователь обязуется:</h2>
          <ul>
            <li>Обеспечить достоверность предоставляемой информации</li>
            <li>
              Обеспечивать сохранность личных данных от доступа третьих лиц
            </li>
            <li>Не копировать информацию с других источников</li>
            <li>
              Не распространять информацию, которая направлена на пропаганду
              войны, разжигание национальной, расовой или религиозной ненависти
              и вражды, а также иной информации, за
            </li>
            <li>
              распространение которой предусмотрена уголовная или
              административная ответственность — не нарушать работоспособность
              сайта
            </li>
            <li>
              Не совершать действия, направленные на введение других
              Пользователей в заблуждение
            </li>
            <li>
              Не передавать в пользование свою учетную запись и/или логин и
              пароль своей учетной записи третьим лицам
            </li>
            <li>
              Не регистрировать учетную запись от имени или вместо другого лица
              за исключением случаев, предусмотренных законодательством РФ
            </li>
            <li>
              Не размещать материалы рекламного, эротического, порнографического
              или оскорбительного характера, а также иную информацию, размещение
              которой запрещено или противоречит нормам действующего
              законодательства РФ — не использовать скрипты (программы) для
              автоматизированного сбора информации и/или взаимодействия с Сайтом
              и его Сервисами
            </li>
          </ul>
          <h2>Администрация обязуется:</h2>
          <p>
            Поддерживать работоспособность сайта за исключением случаев, когда
            это невозможно по независящим от Администрации причинам.
          </p>
          <p>Ответственность сторон:</p>
          <ul>
            <li>
              Пользователь лично несет полную ответственность за
              распространяемую им информацию
            </li>
            <li>
              Администрация не несёт ответственность за несовпадение ожидаемых
              Пользователем и реально полученных услуг
            </li>
            <li>
              Администрация не несет никакой ответственности за услуги,
              предоставляемые третьими лицами
            </li>
            <li>
              В случае возникновения форс-мажорной ситуации (боевые действия,
              чрезвычайное положение, стихийное бедствие и т. д.) Администрация
              не гарантирует сохранность информации, размещённой Пользователем,
              а также бесперебойную работу информационного ресурса
            </li>
          </ul>
          <h2>Условия действия Соглашения</h2>
          <p>
            Данное Соглашение вступает в силу при любом использовании данного
            сайта. Соглашение перестает действовать при появлении его новой
            версии. Администрация оставляет за собой право в одностороннем
            порядке изменять данное соглашение по своему усмотрению.
            Администрация не оповещает пользователей об изменении в Соглашении.
          </p>
        </div>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
// @ts-ignore
import { useHead } from "@unhead/vue";
import { onMounted } from "vue";
const updateSeo = () => {
  const title = `Пользовательское соглашение`;
  const description = `Купить новые автомобили - Ознакомьтесь с нашим ассортиментом и выберите идеальный автомобиль. Удобные условия покупки, кредит и тест-драйв.`;

  useHead({
    title,
    meta: [
      { name: "description", content: description },
      { property: "og:title", content: title },
      { property: "og:description", content: description },
      { property: "og:type", content: "website" },
    ],
  });
};
onMounted(() => {
  updateSeo();
});
</script>

<style scoped lang="scss">
.loan-terms {
  padding: 4rem 0 6rem 0;
  max-width: 110rem;
  margin: 0 auto;
  font-size: 2rem;

  @include bp($point_2) {
    font-size: 1.6rem;
  }
}

.content {
  display: flex;
  flex-direction: column;
  gap: 3rem;
  padding-top: 4rem;
}
.block-term {
  display: flex;
  flex-direction: column;
  gap: 3rem;
}

h1 {
  font-size: 4rem;
  line-height: 120%;
  font-family: "Gilroy";
  font-weight: 600;
  @include bp($point_2) {
    font-size: 2.2rem;
    line-height: 130%;
  }
}
h2 {
  font-size: 2.4rem;
  line-height: 130%;
  font-family: "Gilroy";
  font-weight: 500;
  @include bp($point_2) {
    font-size: 1.8rem;
    line-height: 130%;
  }
}
</style>
